import 'package:thakeren/Constant/AthkarForm.dart';

class TsabehThekr {
  List<AthkarForm> Tsabeh = [
    AthkarForm(
      count: 100,
      Description: "سُبْحَانَ اللَّهِ",
      Reference: "مائة مرة",
      Benefit: "يكتب له ألف حسنة أو يحط عنه ألف خطيئة.",
    ),
    AthkarForm(
      count: 100,
      Description: "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ",
      Reference: "مائة مرة",
      Benefit:
          "حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ.",
    ),
    AthkarForm(
      count: 100,
      Description: "سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ",
      Reference: "مائة مرة",
      Benefit: "تَمْلَآَنِ مَا بَيْنَ السَّمَاوَاتِ وَالْأَرْضِ.",
    ),
    AthkarForm(
      count: 100,
      Description: "سُبْحَانَ اللهِ العَظِيمِ وَبِحَمْدِهِ",
      Reference: "مائة مرة",
      Benefit: "غرست له نخلة في الجنة (أى عدد).",
    ),
    AthkarForm(
      count: 100,
      Description:
          "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ ، سُبْحَانَ اللَّهِ الْعَظِيمِ",
      Reference: "مائة مرة",
      Benefit: "ثقيلتان في الميزان حبيبتان إلى الرحمن (أى عدد).",
    ),
    AthkarForm(
      count: 100,
      Description:
          "لا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلُّ شَيْءِ قَدِيرِ.",
      Reference: "مائة مرة",
      Benefit:
          "كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان.",
    ),
    AthkarForm(
      count: 100,
      Description: "لا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ",
      Reference: "مائة مرة",
      Benefit: "كنز من كنوز الجنة (أى عدد).",
    ),
    AthkarForm(
      count: 100,
      Description: "الْحَمْدُ للّهِ رَبِّ الْعَالَمِينَ",
      Reference: "مائة مرة",
      Benefit: "تملأ ميزان العبد بالحسنات.",
    ),
    AthkarForm(
      count: 100,
      Description: "اللَّهُم صَلِّ وَسَلِم وَبَارِك عَلَى سَيِّدِنَا مُحَمَّدٍ",
      Reference: "مائة مرة",
      Benefit: "من صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة.",
    ),
    AthkarForm(
      count: 100,
      Description: "أستغفر الله",
      Reference: "مائة مرة",
      Benefit: "لفعل الرسول صلى الله عليه وسلم.",
    ),
    AthkarForm(
      count: 100,
      Description:
          "سُبْحَانَ الْلَّهِ، وَالْحَمْدُ لِلَّهِ، وَلَا إِلَهَ إِلَّا الْلَّهُ، وَاللَّهُ أَكْبَرُ",
      Reference: "مائة مرة",
      Benefit:
          "أنهن أحب الكلام الى الله، ومكفرات للذنوب، وغرس الجنة، وجنة لقائلهن من النار، وأحب الى النبي عليه السلام مما طلعت عليه الشمس، والْبَاقِيَاتُ الْصَّالِحَات.",
    ),
    AthkarForm(
      count: 100,
      Description: "لَا إِلَهَ إِلَّا اللهُ",
      Reference: "مائة مرة",
      Benefit: "أفضل الذكر لا إله إلاّ الله.",
    ),
    AthkarForm(
      count: 100,
      Description: "الله أكبر",
      Reference: "مائة مرة",
      Benefit:
          "من قال الله أكبر كتبت له عشرون حسنة وحطت عنه عشرون سيئة. الله أكبر من كل شيء.",
    ),
    AthkarForm(
      count: 100,
      Description:
          "سُبْحَانَ اللَّهِ ، وَالْحَمْدُ لِلَّهِ ، وَلا إِلَهَ إِلَّا اللَّهُ ، وَاللَّهُ أَكْبَرُ ، اللَّهُمَّ اغْفِرْ لِي ، اللَّهُمَّ ارْحَمْنِي ، اللَّهُمَّ ارْزُقْنِي.",
      Reference: "مائة مرة",
      Benefit: "خير الدنيا والآخرة.",
    ),
    AthkarForm(
      count: 100,
      Description:
          "الْحَمْدُ لِلَّهِ حَمْدًا كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ.",
      Reference: "مائة مرة",
      Benefit:
          "قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ‏'‏لَقَدْ رَأَيْتُ اثْنَيْ عَشَرَ مَلَكًا يَبْتَدِرُونَهَا، أَيُّهُمْ يَرْفَعُهَا'‏.",
    ),
    AthkarForm(
      count: 100,
      Description:
          "اللَّهُ أَكْبَرُ كَبِيرًا ، وَالْحَمْدُ لِلَّهِ كَثِيرًا ، وَسُبْحَانَ اللَّهِ بُكْرَةً وَأَصِيلاً.",
      Reference: "مائة مرة",
      Benefit:
          "قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ \"عَجِبْتُ لَهَا ، فُتِحَتْ لَهَا أَبْوَابُ السَّمَاءِ\".",
    ),
    AthkarForm(
      count: 100,
      Description:
          "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ , وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ , اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ.",
      Reference: "مائة مرة",
      Benefit:
          "في كل مره تحط عنه عشر خطايا ويرفع له عشر درجات ويصلي الله عليه عشرا وتعرض على الرسول صلى الله عليه وسلم (أى عدد).",
    ),
  ];
}
